tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_switch.h"
#include "fsl_netc_soc.h"
#include "fsl_netc_timer.h"
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051587) && FSL_FEATURE_NETC_HAS_ERRATA_051587
#include <math.h>
#endif

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.netc_switch"
#endif

/*! @name NETC register map. */
/*@{*/
#define NETC_SWT_PORT_GROUP_BASE_OFFSET (0x4000U) /*!< The Switch port group register base address offset. */

/*! @brief Pointers to netc bases for each instance. */
static ENETC_PCI_TYPE0_Type *const s_netcPciBases[] = ENETC_PCI_TYPE0_BASE_PTRS;

/*! @brief Pointers to netc bases for each instance. */
static NETC_SW_Type *const s_netcSWBases[] = NETC_SW_BASE_PTRS;

/*! @brief Common message data buffer for command ring 0 and ring 1, data buffer address need align with 16 bytes */
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t dataBuffer0, 16);
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t dataBuffer1, 16);
static netc_tb_data_buffer_t *s_cmdDataBuffer[2] = {&dataBuffer0, &dataBuffer1};
/*!< Management ENETC SI 0 Rx ring hardware index, this ring is only used for receive frames with Host Reason filed not
 * zero. */
static uint8_t mgmtRxBdRingIdx;

static void SWT_GetBaseResource(swt_handle_t *handle, netc_hw_switch_idx_t sw)
{
    handle->hw.func   = s_netcPciBases[NETC_SOC_SWT_PCIE_FUNC_OFFSET + (uint32_t)sw];
    handle->hw.base   = s_netcSWBases[sw];
    handle->hw.common = (NETC_SW_ENETC_Type *)((uintptr_t)handle->hw.base + NETC_SWT_COMMON_BASE_OFFSET);
    handle->hw.global = (ENETC_GLOBAL_Type *)((uintptr_t)handle->hw.base + NETC_SWT_GLOBAL_BASE_OFFSET);
    for (uint32_t i = 0U; i < (uint32_t)FSL_FEATURE_NETC_SWITCH_MAX_PORT_NUMBER; i++)
    {
        handle->hw.ports[i].port =
            (NETC_PORT_Type *)((uintptr_t)handle->hw.base + (i + 1U) * NETC_SWT_PORT_GROUP_BASE_OFFSET);
        handle->hw.ports[i].eth = (NETC_ETH_LINK_Type *)((uintptr_t)handle->hw.ports[i].port + 0x1000U);
    }
    handle->hw.msixTable =
        (netc_msix_entry_t *)((uintptr_t)FSL_FEATURE_NETC_MSIX_TABLE_BASE +
                              NETC_MSIX_TABLE_OFFSET * (NETC_SOC_SWT_MSI_FUNC_OFFSET + (uint32_t)sw));
}

/*!
 * @brief Set the MSIX entry table
 *
 * This function is to set entry table in specified MSIX Table memory. After entry table setup, set interrupts
 * vector/entry index.
 *
 * @param handle  The SWT handle.
 * @param config  The SWT configuration.
 * @return status_t
 */
static status_t SWT_MSIXSetEntryTable(swt_handle_t *handle, const swt_config_t *config)
{
    uint32_t *msixTable  = (uint32_t *)(uintptr_t)handle->hw.msixTable;
    uint32_t *entryTable = (uint32_t *)(uintptr_t)config->msixEntry;
    uint8_t msixNum;

    msixNum =
        (uint8_t)(((handle->hw.base->SCAPR0 & NETC_SW_SCAPR0_NUM_MSIX_MASK) >> NETC_SW_SCAPR0_NUM_MSIX_SHIFT) + 1U);

    /* Entry > 0, enable MSIX. */
    if (config->entryNum != 0U)
    {
        if (config->entryNum > msixNum)
        {
            return kStatus_InvalidArgument;
        }

        if (MAX(MAX(config->cmdBdrEntryIdx[0], config->cmdBdrEntryIdx[1]), config->timeCaptureEntryIdx) >=
            config->entryNum)
        {
            return kStatus_InvalidArgument;
        }

        /* Use 32-bit access to set MSIX table. */
        for (uint32_t i = 0; i < config->entryNum; i++)
        {
            msixTable[i * 4U]      = entryTable[i * 4U];
            msixTable[i * 4U + 1U] = entryTable[i * 4U + 1U];
            msixTable[i * 4U + 2U] = entryTable[i * 4U + 2U];
            msixTable[i * 4U + 3U] = entryTable[i * 4U + 3U];
        }

        /* Set MSIX entry index. */
        handle->hw.base->NUM_CBDR_INT[0].CBDRMSIVR =
            (uint32_t)config->cmdBdrEntryIdx[0] & NETC_SW_CBDRMSIVR_VECTOR_MASK;
        handle->hw.base->NUM_CBDR_INT[1].CBDRMSIVR =
            (uint32_t)config->cmdBdrEntryIdx[1] & NETC_SW_CBDRMSIVR_VECTOR_MASK;
        handle->hw.common->TCMSIVR = (uint32_t)config->timeCaptureEntryIdx & NETC_SW_ENETC_TCMSIVR_VECTOR_MASK;

        /* Enable MSIX. */
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK;
    }
    else
    {
        /* Disable MSIX. */
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
    }

    return kStatus_Success;
}

status_t SWT_MsixSetGlobalMask(swt_handle_t *handle, bool mask)
{
    if (mask)
    {
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL |= ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
    }
    else
    {
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL &= (uint16_t)(~ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK);
    }

    return kStatus_Success;
}

status_t SWT_MsixSetEntryMask(swt_handle_t *handle, uint8_t entryIdx, bool mask)
{
    status_t result;

    if (entryIdx < handle->cfg.entryNum)
    {
        handle->hw.msixTable[entryIdx].control = (uint32_t)mask;
        result                                 = kStatus_Success;
    }
    else
    {
        result = kStatus_Fail;
    }

    return result;
}

status_t SWT_MsixGetPendingStatus(swt_handle_t *handle, uint8_t pbaIdx, uint64_t *status)
{
    status_t result = kStatus_Success;
    bool funcEnable;

    if (handle->cfg.entryNum == 0U)
    {
        return kStatus_Fail;
    }

    /* Check MSIX enable status. */
    funcEnable = ((handle->hw.func->PCI_CFC_MSIX_MSG_CTL & ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK) != 0U);

    if (funcEnable)
    {
        if (pbaIdx <= ((handle->cfg.entryNum - 1U) / 64U))
        {
            *status = *(uint64_t *)((uintptr_t)handle->hw.msixTable + NETC_MSIX_TABLE_PBA_OFFSET + 8U * pbaIdx);
            result  = kStatus_Success;
        }
        else
        {
            result = kStatus_InvalidArgument;
        }
    }
    else
    {
        *status = 0;
        result  = kStatus_Fail;
    }

    return result;
}

