tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_GetDefaultConfig(swt_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(swt_config_t));
    for (uint32_t i = 0U; i < NETC_SOC_SWT_PORT_NUM; i++)
    {
        config->ports[i].bridgeCfg.acceptUntag          = true;
        config->ports[i].bridgeCfg.acceptPriorityTag    = true;
        config->ports[i].bridgeCfg.acceptSingleTag      = true;
        config->ports[i].bridgeCfg.acceptDoubleTag      = true;
        config->ports[i].bridgeCfg.enSrcPortPrun        = true;
        config->ports[i].bridgeCfg.enMacStationMove     = true;
        config->ports[i].bridgeCfg.stgMode[0]           = kNETC_ForwardFrame;
        config->ports[i].bridgeCfg.bcastRpEntryID       = 0xFFFU;
        config->ports[i].bridgeCfg.unUcastRpEntryID     = 0xFFFU;
        config->ports[i].bridgeCfg.unMcastRpEntryID     = 0xFFFU;
        config->ports[i].bridgeCfg.mcastEntryID         = 0xFFFU;
        config->ports[i].isiCfg.defaultISEID            = 0xFFFFU;
        config->ports[i].commonCfg.acceptTpid.innerMask = (uint8_t)kNETC_OuterStanCvlan | (uint8_t)kNETC_OuterStanSvlan;
        config->ports[i].commonCfg.acceptTpid.outerMask = (uint8_t)kNETC_InnerStanCvlan | (uint8_t)kNETC_InnerStanSvlan;
        config->ports[i].commonCfg.pSpeed               = 0x63U;
        config->ports[i].commonCfg.rxTsSelect           = kNETC_SyncTime;
#if (defined(FSL_FEATURE_NETC_HAS_PORT_FCSEA) && FSL_FEATURE_NETC_HAS_PORT_FCSEA)
        config->ports[i].commonCfg.stompFcs = true;
#endif
        config->ports[i].commonCfg.rxPpduBco                     = 20U;
        config->ports[i].commonCfg.txPpduBco                     = 20U;
        config->ports[i].commonCfg.timeGate.holdSkew             = 64;
        config->ports[i].commonCfg.parser.l2PloadCount           = 24;
        config->ports[i].commonCfg.parser.l3PayloadCount         = 24;
        config->ports[i].commonCfg.parser.enableL3Parser         = true;
        config->ports[i].commonCfg.parser.l4PayloadCount         = 24;
        config->ports[i].commonCfg.parser.enableL4Parser         = true;
        config->ports[i].ethMac.PreemptionConfig.preemptMode     = kNETC_PreemptDisable;
        config->ports[i].ethMac.PreemptionConfig.enMergeVerify   = false;
        config->ports[i].ethMac.PreemptionConfig.mergeVerifyTime = 10U;
        config->ports[i].ethMac.PreemptionConfig.raf_size        = kNETC_RafSize64;
        config->ports[i].ethMac.enTxPad                          = true;
        config->ports[i].ethMac.rxMinFrameSize                   = 64U;
        config->ports[i].ethMac.rxMaxFrameSize                   = 0x600U;
        config->ports[i].ethMac.maxBackPressOn                   = 3036U;
        config->ports[i].ethMac.minBackPressOff                  = 20U;
        config->ports[i].enTxRx                                  = true;
        for (uint32_t j = 0U; j < 8U; j++)
        {
            config->ports[i].txTcCfg[j].enTcGate           = true;
            config->ports[i].txTcCfg[j].sduCfg.maxSduSized = 0x600U;
            config->ports[i].txTcCfg[j].sduCfg.sduType     = kNETC_MPDU;
            config->ports[i].ipvToTC[j]                    = (uint8_t)j;
        }
    }
    for (uint32_t i = 0U; i < 2U; i++)
    {
        for (uint32_t j = 0U; j < 8U; j++)
        {
            config->rxqosCfg.profiles[i].ipv[j * 2U]      = (uint8_t)j;
            config->rxqosCfg.profiles[i].ipv[j * 2U + 1U] = (uint8_t)j;
            config->rxqosCfg.profiles[i].dr[j * 2U + 1U]  = 2U;
        }
    }
    config->bridgeCfg.dVFCfg.portMembership = 0x1FU;
    config->bridgeCfg.dVFCfg.mfo            = kNETC_FDBLookUpWithFlood;
    config->bridgeCfg.dVFCfg.mlo            = kNETC_HardwareMACLearn;
    config->imrCfg.dr                       = 3;
    config->imrCfg.enMirror                 = false;
    config->imrCfg.efmEntryID               = 0xFFFFU;

    return kStatus_Success;
}

/*!
 * @brief Free all Rx buffers
 *
 * @param handle  The Switch handle.
 */
static void SWT_RxBufferFreeAll(swt_handle_t *handle)
{
    netc_rx_bdr_t *rxBdRing;
    uint32_t maxHwBdNum;
    uint32_t index;

    if (handle->cfg.rxZeroCopy)
    {
        rxBdRing = &handle->mgmtRxBdRing;
        /* Hardware BD number means actual BD number in hardware view, two standard BDs act as one extended BD. */
        maxHwBdNum = rxBdRing->extendDesc ? (rxBdRing->len / 2U) : rxBdRing->len;

        for (index = 0U; index < maxHwBdNum; index++)
        {
            if (rxBdRing->buffArray[index] != 0U)
            {
                handle->cfg.rxBuffFree(handle, (void *)(uint8_t *)(uintptr_t)rxBdRing->buffArray[index],
                                       handle->cfg.userData);
            }
        }
    }
}

status_t SWT_Init(swt_handle_t *handle, const swt_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    status_t result = kStatus_Success;
    NETC_PORT_Type *port;

    (void)memset(handle, 0, sizeof(swt_handle_t));
    /* Get the register map resource for switch */
    SWT_GetBaseResource(handle, config->switchIdx);
    /* Enable master bus and memory access for PCIe and MSI-X first to do ETH MAC reset*/
    handle->hw.func->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
    /* Do software reset for all ETH MAC to clear Tx/Rx FIFO*/
    for (uint32_t i = 0U; (i < NETC_SOC_SWT_PORT_NUM) && (!NETC_PortIsPseudo(handle->hw.ports[i].port)); i++)
    {
        handle->hw.ports[i].port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
        NETC_PortSoftwareResetEthMac(handle->hw.ports[i].eth);
    }
    /* Reset this function */
    handle->hw.func->PCI_CFC_PCIE_DEV_CTL |= ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK;
    while ((handle->hw.func->PCI_CFC_PCIE_DEV_CTL & ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK) != 0U)
    {
    }
    /* Enable master bus and memory access for PCIe and MSI-X */
    handle->hw.func->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051260) && FSL_FEATURE_NETC_HAS_ERRATA_051260)
    /* Errata 051260: All NETC functions need to be enabled for switch NTMP operation */
    ENETC0_PCI_HDR_TYPE0->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
    ENETC1_PCI_HDR_TYPE0->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
#endif
    /* Store configuration in handle */
    handle->cfg.cmdRingUse = config->cmdRingUse;
    handle->cfg.entryNum   = config->entryNum;
    /* Store configuration in handle */
    result = SWT_MSIXSetEntryTable(handle, config);
    if (result != kStatus_Success)
    {
        return result;
    }
    /* Configure switch ingress mirror destination */
    if (kStatus_Success != SWT_RxMirrorConfig(handle, &config->imrCfg))
    {
        return kStatus_Fail;
    }
    /* Configure switch FDB hash table maximum number of  dynamically entries */
    handle->hw.base->FDBHTMCR = NETC_SW_FDBHTMCR_DYN_LIMIT(config->dynFDBLimit);
    /* Configure switch bridge */
    (void)SWT_BridgeInit(handle, &config->bridgeCfg);
    /* Configure switch command BD rings */
    for (uint32_t i = 0U; i < config->cmdRingUse; i++)
    {
        result = SWT_CmdBDRInit(handle, (netc_hw_swt_cbdr_idx_t)i, &config->cmdBdrCfg[i]);
        if (kStatus_Success != result)
        {
            return result;
        }
        handle->cmdBdRing[i].bdBase        = config->cmdBdrCfg[i].bdBase;
        handle->cmdBdRing[i].bdLength      = config->cmdBdrCfg[i].bdLength;
        handle->cmdBdRing[i].producerIndex = 0U;
        handle->cmdBdRing[i].cleanIndex    = 0U;
        handle->cmdBdRing[i].bdrEnable     = true;
    }
    /* Configure switch Ingress Port Filtering */
    (void)SWT_RxIPFInit(handle, &config->ipfCfg);
    /* Configure switch Ingress VLAN classification */
    (void)SWT_RxVlanCInit(handle, &config->vlanCfg);
    /* Configure switch Ingress QOS classification */
    (void)SWT_RxQosCInit(handle, &config->rxqosCfg);
    /* Configure switch egress QOS to VLAN map classification */
    (void)SWT_TxEPPQosToVlanConfig(handle, &config->txqosCfg);
    /* Configure switch PSFP */
    (void)SWT_RxPSFPInit(handle, &config->psfpCfg);
    /* Configure all ports and macs */
    for (uint32_t i = 0U; i < NETC_SOC_SWT_PORT_NUM; i++)
    {
        if (config->ports[i].enTxRx)
        {
            /* Config TGS on PSI side */
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
            result = SWT_TxPortTGSEnable(handle, (netc_hw_port_idx_t)i, config->ports[i].enableTg, 0xFFU);
#else
            result = SWT_TxPortTGSEnable(handle, (netc_hw_port_idx_t)i, config->ports[i].enableTg);
#endif
            if (result != kStatus_Success)
            {
                return result;
            }
            port = handle->hw.ports[i].port;
            (void)SWT_BridgeConfigPort(handle, (netc_hw_port_idx_t)i, &config->ports[i].bridgeCfg);
            (void)SWT_FMConfigPort(handle, (netc_hw_port_idx_t)i, &config->ports[i].fmCfg);
            (void)NETC_PortSetISI(port, &config->ports[i].isiCfg);
            (void)NETC_PortConfig(port, &config->ports[i].commonCfg);
            port->PMCR = NETC_PORT_PMCR_IMIRE(config->ports[i].enMirror);
#if defined(NETC_PORT_PLANIDCR_LANID)
            port->PLANIDCR = NETC_PORT_PLANIDCR_LANID(config->ports[i].lanID);
#endif
            (void)SWT_SetPortIPV2QMR(handle, (netc_hw_port_idx_t)i, config->ports[i].ipvToTC);
            port->PBPMCR0 = NETC_PORT_PBPMCR0_IPV3_INDEX(config->ports[i].ipvToBP[3]) |
                            NETC_PORT_PBPMCR0_IPV2_INDEX(config->ports[i].ipvToBP[2]) |
                            NETC_PORT_PBPMCR0_IPV1_INDEX(config->ports[i].ipvToBP[1]) |
                            NETC_PORT_PBPMCR0_IPV0_INDEX(config->ports[i].ipvToBP[0]);
            port->PBPMCR1 = NETC_PORT_PBPMCR1_IPV7_INDEX(config->ports[i].ipvToBP[7]) |
                            NETC_PORT_PBPMCR1_IPV6_INDEX(config->ports[i].ipvToBP[6]) |
                            NETC_PORT_PBPMCR1_IPV5_INDEX(config->ports[i].ipvToBP[5]) |
                            NETC_PORT_PBPMCR1_IPV4_INDEX(config->ports[i].ipvToBP[4]);
            /* Configure Ethernet MAC */
            if (!NETC_PortIsPseudo(port))
            {
                (void)NETC_PortConfigEthMac(handle->hw.ports[i].eth, &config->ports[i].ethMac);
                port->PCTFCR = NETC_PORT_PCTFCR_ECTS(!config->ports[i].outCutThrough) |
#if defined(NETC_PORT_PCTFCR_BSQS_MASK)
                               NETC_PORT_PCTFCR_BSQS(config->ports[i].outBufferSize) |
#endif
                               NETC_PORT_PCTFCR_ICTS(!config->ports[i].inCutThrough);
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051202) && FSL_FEATURE_NETC_HAS_ERRATA_051202)
                /* RT1180 errata 051202: Configure Tx MAC to wait until 32 bytes of data are built up in the transmit
                 * FIFO before beginning transmission on the link */
                *(volatile uint32_t *)((uintptr_t)handle->hw.ports[i].eth + 0x1020U) = 0x00010104;
                *(volatile uint32_t *)((uintptr_t)handle->hw.ports[i].eth + 0x1420U) = 0x00010104;
#endif
            }
            /* Configure traffic class */
            for (uint32_t j = 8U; j > 0U; j--)
            {
                result = SWT_TxTrafficClassConfig(handle, (netc_hw_port_idx_t)i, (netc_hw_tc_idx_t)(uint32_t)(j - 1U),
                                                  &config->ports[i].txTcCfg[(j - 1U)]);
                if (result != kStatus_Success)
                {
                    return result;
                }
            }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
            /* Clear Tx/Rx disable to allow traffic to flow */
            handle->hw.ports[i].port->POR &= ~(NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
#endif
        }
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
        else
        {
            /* Disable the unused port Tx/Rx */
            handle->hw.ports[i].port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
        }
#endif
    }
    return result;
}

status_t SWT_Deinit(swt_handle_t *handle)
{
    for (uint32_t i = 0U; i < handle->cfg.cmdRingUse; i++)
    {
        (void)SWT_CmdBDRDeinit(handle, (netc_hw_swt_cbdr_idx_t)i);
    }
    for (uint32_t i = 0U; i < NETC_SOC_SWT_PORT_NUM; i++)
    {
        if (!NETC_PortIsPseudo(handle->hw.ports[i].port) &&
            (0U == (handle->hw.ports[i].port->POR & (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK))))
        {
            NETC_PortEthMacGracefulStop(handle->hw.ports[i].port);
        }
    }
    SWT_RxBufferFreeAll(handle);

    return kStatus_Success;
}

status_t SWT_SetEthPortMII(swt_handle_t *handle,
                           uint8_t ethPort,
                           netc_hw_mii_speed_t speed,
                           netc_hw_mii_duplex_t duplex)
{
    netc_hw_mii_mode_t miiMode;

    if (ethPort >= (uint8_t)FSL_FEATURE_NETC_SWITCH_ETH_PORT_NUMBER)
    {
        return kStatus_InvalidArgument;
    }
    else
    {
        miiMode = NETC_PortGetMIIMode(handle->hw.ports[ethPort].eth);
        return NETC_PortSetMII(handle->hw.ports[ethPort].eth, miiMode, speed, duplex);
    }
}

status_t SWT_PortStop(swt_handle_t *handle, netc_hw_port_idx_t portIdx)
{
    if (!NETC_PortIsPseudo(handle->hw.ports[portIdx].port))
    {
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051398) && FSL_FEATURE_NETC_HAS_ERRATA_051398)
        NETC_PORT_Type *base              = handle->hw.ports[portIdx].port;
        NETC_ETH_LINK_Type *eth           = (NETC_ETH_LINK_Type *)((uintptr_t)base + 0x1000U);
        bool hasPM1                       = 0U != (eth->MAC_MERGE_MMCSR & NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_MASK);
        netc_tb_etmcg_config_t cgEntryCfg = {
            .cfge.tdDr0En = 1U, .cfge.tdDr1En = 1U, .cfge.tdDr2En = 1U, .cfge.tdDr3En = 1U};

        /* Configure congestion group to enable tail drop (with corresponding threshold set to 0) for each DR level
         */
        for (uint32_t i = 0U; i < 8U; i++)
        {
            cgEntryCfg.entryID = NETC_TB_ETM_CG_ENTRY_ID(portIdx, i);
            if (kStatus_Success != SWT_TxETMConfigCongestionGroup(handle, &cgEntryCfg))
            {
                return kStatus_Fail;
            }
        }
        /* Wait for PMa_IEVENT[TX_EMPTY] to be set. */
        while (0U == (eth->PM0_IEVENT & NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_MASK))
        {
        }
        if (hasPM1)
        {
            while (0U == (eth->PM1_IEVENT & NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_MASK))
            {
            }
            eth->PM1_COMMAND_CONFIG &= ~NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_MASK;
        }
        /* Set POR[TXDIS] to 1b. */
        base->POR |= NETC_PORT_POR_TXDIS_MASK;
        /* Disable the congestion group tail drop(s) */
        (void)memset(&cgEntryCfg, 0, sizeof(netc_tb_etmcg_config_t));
        for (uint32_t i = 0U; i < 8U; i++)
        {
            cgEntryCfg.entryID = NETC_TB_ETM_CG_ENTRY_ID(portIdx, i);
            if (kStatus_Success != SWT_TxETMConfigCongestionGroup(handle, &cgEntryCfg))
            {
                return kStatus_Fail;
            }
        }
        /* Wait 64 byte time for Tx packet transmission to complete. */
        SDK_DelayAtLeastUs(512, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        /* Write PMa_COMMAND_CONFIG[TX_EN]=0b.  */
        eth->PM0_COMMAND_CONFIG &= ~NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_MASK;
        if (hasPM1)
        {
            eth->PM1_COMMAND_CONFIG &= ~NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_MASK;
        }

        /* In order to stop receive */
        eth->PM0_COMMAND_CONFIG &= ~NETC_ETH_LINK_PM0_COMMAND_CONFIG_RX_EN_MASK;
        while (0U == (eth->PM0_IEVENT & NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_MASK))
        {
        }
        if (hasPM1)
        {
            eth->PM1_COMMAND_CONFIG &= ~NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_MASK;
            while (0U == (eth->PM1_IEVENT & NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_MASK))
            {
            }
        }
        while (0U != (base->PSR & NETC_PORT_PSR_RX_BUSY_MASK))
        {
        }
        base->POR |= NETC_PORT_POR_RXDIS_MASK;
#else
        NETC_PortEthMacGracefulStop(handle->hw.ports[portIdx].port);
#endif
    }
    else
    {
        /* Disable the port Tx/Rx directly */
        handle->hw.ports[portIdx].port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
    }
    return kStatus_Success;
}

status_t SWT_SetPortMaxFrameSize(swt_handle_t *handle, netc_hw_port_idx_t portIdx, uint16_t size)
{
    assert(handle != NULL);

    NETC_PORT_Type *base = handle->hw.ports[portIdx].port;

    if (NETC_PortIsPseudo(base))
    {
        return kStatus_InvalidArgument;
    }

    return NETC_PortSetMaxFrameSize(handle->hw.ports[portIdx].eth, size);
}

status_t SWT_RxMirrorConfig(swt_handle_t *handle, const netc_swt_imr_config_t *config)
{
    assert((handle != NULL) && (config != NULL));

    handle->hw.base->IMDCR0 =
        NETC_SW_IMDCR0_PORT((kNETC_SWTMPort != config->destPort) ? (uint32_t)config->destPort : 0U) |
        NETC_SW_IMDCR0_DR(config->dr) | NETC_SW_IMDCR0_IPV(config->ipv) |
        NETC_SW_IMDCR0_MIRDEST((kNETC_SWTMPort == config->destPort) ? 1U : 0U) | NETC_SW_IMDCR0_MIREN(config->enMirror);
    if ((kNETC_SWTMPort == config->destPort) && (0xFFFFU != config->efmEntryID))
    {
        return kStatus_Fail;
    }
    else
    {
        handle->hw.base->IMDCR1 =
            NETC_SW_IMDCR1_EFM_LEN_CHANGE(config->efmLengthChange) | NETC_SW_IMDCR1_EFMEID(config->efmEntryID);
        return kStatus_Success;
    }
}

/*!
 * @brief Store necessary configuration constant in the handle
 *
 * @param handle  The SWT handle.
 * @param config  The user configuration.
 */
static void SWT_StoreTransConfig(swt_handle_t *handle, const swt_transfer_config_t *config)
{
    handle->cfg.rxCacheMaintain   = config->rxCacheMaintain;
    handle->cfg.txCacheMaintain   = config->txCacheMaintain;
    handle->cfg.rxZeroCopy        = config->rxZeroCopy;
    handle->cfg.rxBuffAlloc       = config->rxBuffAlloc;
    handle->cfg.rxBuffFree        = config->rxBuffFree;
    handle->cfg.enUseMgmtRxBdRing = config->enUseMgmtRxBdRing;
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    handle->cfg.enUseMgmtTxBdRing = config->enUseMgmtTxBdRing;
#endif
    handle->cfg.reclaimCallback = config->reclaimCallback;
    handle->cfg.userData        = config->userData;
}

status_t SWT_ManagementTxRxConfig(swt_handle_t *handle, ep_handle_t *epHandle, const swt_transfer_config_t *txRxConfig)
{
    assert((handle != NULL) && (epHandle != NULL) && (txRxConfig != NULL));

    const netc_rx_bdr_config_t *rxRingConfig;
    netc_rx_bd_t *rxDesc;
    uint64_t buffAddr;
    uint32_t buffIdx;

    handle->epHandle = epHandle;
    SWT_StoreTransConfig(handle, txRxConfig);
    if ((!NETC_EnetcHasManagement(epHandle->hw.base)) || (getSiNum(epHandle->cfg.si) != 0U))
    {
        /* Management frame only can be Tx/Rx on Switch management ENETC SI 0 */
        return kStatus_InvalidArgument;
    }
    if (txRxConfig->enUseMgmtRxBdRing)
    {
        rxRingConfig = &txRxConfig->mgmtRxBdrConfig;
        /* Get Management Rx ring hardware index */
        mgmtRxBdRingIdx = (uint8_t)(((epHandle->hw.base->NUM_SI[0].PSICFGR0 & NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK) >>
                                     NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT) -
                                    1U);
        if (NETC_SIConfigRxBDR(epHandle->hw.si, mgmtRxBdRingIdx, rxRingConfig) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->mgmtRxBdRing.extendDesc = rxRingConfig->extendDescEn;
        handle->mgmtRxBdRing.bdBase     = rxRingConfig->bdArray;
        handle->mgmtRxBdRing.len        = rxRingConfig->len;
        handle->mgmtRxBdRing.buffSize   = rxRingConfig->buffSize;
        /* Make all frames with the metadata field Host Reason set to non-zero are directed to this Management Rx ring
         */
        for (uint8_t i = 0U; i < NETC_ENETC_SMHRBDRMR_COUNT; i++)
        {
            epHandle->hw.base->SMHRBDRMR[i] = NETC_ENETC_SMHRBDRMR_RXBDR(mgmtRxBdRingIdx);
        }
        rxDesc = &rxRingConfig->bdArray[0];

        /* Store address information in the array in case the buffer address is lost due to Rx BD write-back. */
        handle->mgmtRxBdRing.buffArray = rxRingConfig->buffAddrArray;

        /* Initialize the buffers in Rx BD ring. */
        for (uint32_t index = 0U; index < rxRingConfig->len; index++)
        {
            /* Clear Rx BD before config the receive buffer start address */
            (void)memset(rxDesc, 0, sizeof(netc_rx_bd_t));

