tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
void SWT_ReclaimTxDescriptor(swt_handle_t *handle, bool enMasquerade, uint8_t ring)
{
    netc_tx_frame_info_t *frameInfo;

    do
    {
        if (enMasquerade)
        {
            /* Port masquerade still use ep transfer handle */
            frameInfo = EP_ReclaimTxDescCommon(handle->epHandle, &handle->epHandle->txBdRing[ring], ring + 1U,
                                               (handle->epHandle->cfg.reclaimCallback != NULL));
        }
        else
        {
            frameInfo = EP_ReclaimTxDescCommon(handle->epHandle, &handle->mgmtTxBdRing, 0,
                                               (handle->cfg.reclaimCallback != NULL));
        }
        if (frameInfo != NULL)
        {
            /* If reclaim callback is enabled, it must be called for each full frame. */
            if (enMasquerade)
            {
                /* Port masquerade still use ep transfer handle */
                (void)handle->epHandle->cfg.reclaimCallback(handle->epHandle, ring, frameInfo,
                                                            handle->epHandle->cfg.userData);
            }
            else
            {
                (void)handle->cfg.reclaimCallback(handle, frameInfo, handle->cfg.userData);
            }
        }
    } while (frameInfo != NULL);
}

status_t SWT_GetTimestampRefResp(swt_handle_t *handle, swt_tsr_resp_t *tsr)
{
    status_t result         = kStatus_Fail;
    netc_rx_bdr_t *rxBdRing = NULL;
    netc_rx_bd_t *rxDesc    = NULL;
    uint64_t rxDmaBuff;
    uint16_t index;
    uint8_t rxBdRingIdx;

    if (handle->cfg.enUseMgmtRxBdRing)
    {
        rxBdRing    = &handle->mgmtRxBdRing;
        rxBdRingIdx = mgmtRxBdRingIdx;
    }
    else if (handle->epHandle->cfg.rxRingUse != 0U)
    {
        /* If no management Rx ring is specified, the host reason not zero frames will be received by Rx ring 0 */
        rxBdRing    = &handle->epHandle->rxBdRing[0];
        rxBdRingIdx = 0;
    }
    else
    {
        /* If both the switch and its associated EP not config the Rx BD ring, no frame can be received */
        return kStatus_InvalidArgument;
    }

    rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if ((rxDesc->resp.isReady != 0U) && ((netc_host_reason_t)rxDesc->resp.hr == kNETC_TimestampResp) &&
        (rxDesc->resp.error == 0U))
    {
        tsr->timestamp = rxDesc->resp.timestamp;
        tsr->txtsid    = rxDesc->resp.txtsid;
        /* Set the Rx buffer address in BD which is overwritten by BD writeback. */
        index     = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
        rxDmaBuff = rxBdRing->buffArray[index];
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        rxDmaBuff = (uint64_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)rxDmaBuff, kMEMORY_Local2DMA);
#endif
        rxDesc->standard.addr = rxDmaBuff;
        /* Updates the receive buffer descriptors flags, only clear necessary field. */
        rxDesc->writeback.isFinal = 0;
        rxDesc->writeback.isReady = 0;
        if (rxBdRing->extendDesc)
        {
            /* Extended BD occupies one more 16 bytes space. */
            rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
        }
        rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
        /* Update the Rx consumer index to free BD. */
        index = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
        NETC_SISetRxConsumer(handle->epHandle->hw.si, rxBdRingIdx, index);
        result = kStatus_Success;
    }

    return result;
}
#endif

status_t SWT_GetRxFrameSize(swt_handle_t *handle, uint32_t *length)
{
    assert((handle != NULL) && (length != NULL));
    netc_rx_bdr_t *rxBdRing = NULL;
    status_t result;

    if (handle->cfg.enUseMgmtRxBdRing)
    {
        rxBdRing = &handle->mgmtRxBdRing;
    }
    else if (handle->epHandle->cfg.rxRingUse != 0U)
    {
        /* If no management Rx ring is specified, the host reason not zero frames will be received by Rx ring 0 */
        rxBdRing = &handle->epHandle->rxBdRing[0];
    }
    else
    {
        /* If both the switch and its associated EP not config the Rx BD ring, no frame can be received */
        return kStatus_InvalidArgument;
    }

    result = EP_GetRxFrameSizeCommon(handle->epHandle, rxBdRing, length);
    if (kStatus_NETC_RxHRNotZeroFrame == result)
    {
        /* Only return success when currently frame is host reason not zero frame */
        result = kStatus_Success;
    }
    return result;
}

status_t SWT_ReceiveFrameCopy(swt_handle_t *handle, void *buffer, uint32_t length, netc_frame_attr_t *attr)
{
    assert((handle != NULL) && (((buffer != NULL) && (length != 0U)) || (buffer == NULL)));
    netc_rx_bdr_t *rxBdRing = NULL;
    uint8_t rxBdRingIdx;

    if (handle->cfg.enUseMgmtRxBdRing)
    {
        rxBdRing    = &handle->mgmtRxBdRing;
        rxBdRingIdx = mgmtRxBdRingIdx;
    }
    else if (handle->epHandle->cfg.rxRingUse != 0U)
    {
        /* If no management Rx ring is specified, the host reason not zero frames will be received by Rx ring 0 */
        rxBdRing    = &handle->epHandle->rxBdRing[0];
        rxBdRingIdx = 0;
    }
    else
    {
        /* If both the switch and its associated EP not config the Rx BD ring, no frame can be received */
        return kStatus_InvalidArgument;
    }

    return EP_ReceiveFrameCopyCommon(handle->epHandle, rxBdRing, rxBdRingIdx, buffer, length, attr,
                                     handle->cfg.rxCacheMaintain);
}

status_t SWT_ReceiveFrame(swt_handle_t *handle, netc_frame_struct_t *frame, netc_frame_attr_t *attr)
{
    assert((handle != NULL) && (frame != NULL) && (handle->cfg.rxZeroCopy));

    status_t result         = kStatus_Success;
    netc_rx_bdr_t *rxBdRing = NULL;
    netc_rx_bd_t *rxDesc    = NULL;
    uint32_t buffNum        = 0;
    uint8_t rxBdRingIdx;
    uint16_t index;
    void *newBuff;

