tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
    if (handle->cfg.enUseMgmtRxBdRing)
    {
        rxBdRing    = &handle->mgmtRxBdRing;
        rxBdRingIdx = mgmtRxBdRingIdx;
    }
    else if (handle->epHandle->cfg.rxRingUse != 0U)
    {
        /* If no management Rx ring is specified, the host reason not zero frames will be received by Rx ring 0 */
        rxBdRing    = &handle->epHandle->rxBdRing[0];
        rxBdRingIdx = 0;
    }
    else
    {
        /* If both the switch and its associated EP not config the Rx BD ring, no frame can be received */
        return kStatus_InvalidArgument;
    }

    rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if (rxDesc->writeback.isReady == 0U)
    {
        /* Reset the buffer array length. */
        frame->length = 0;
        return kStatus_NETC_RxFrameEmpty;
    }
    else
    {
        /* Check the status of the received frame. */
        if (rxDesc->writeback.error != 0U)
        {
            result = kStatus_NETC_RxFrameError;
        }
        else if ((netc_host_reason_t)rxDesc->writeback.hr == kNETC_TimestampResp)
        {
            /* Get Transmit Timestamp Reference Response messages, use special API to receive this information. */
            return kStatus_NETC_RxTsrResp;
        }
        else
        {
            if ((netc_host_reason_t)rxDesc->writeback.hr == kNETC_RegularFrame)
            {
                /* Return without receive when currently frame is regular frame */
                return kStatus_NETC_RxHRZeroFrame;
            }
            /* Check how many buffers will be taken away to receive one frame. */
            index = rxBdRing->index;
            do
            {
                buffNum++;

                /* Find the last BD of this frame. */
                if (rxDesc->writeback.isFinal != 0U)
                {
                    break;
                }

                if (rxBdRing->extendDesc)
                {
                    /* Extended BD needs additional offset. */
                    index = EP_IncreaseIndex(index, rxBdRing->len);
                }
                index  = EP_IncreaseIndex(index, rxBdRing->len);
                rxDesc = &rxBdRing->bdBase[index];
            } while (index != rxBdRing->index);

            /* The buffer array length provided by application is not enough to receive frame. */
            if (buffNum > frame->length)
            {
                return kStatus_NETC_LackOfResource;
            }

            /* Prepare the buffer from appliction to exchange with the buffer in the BD. */
            index = 0;
            do
            {
                newBuff = handle->cfg.rxBuffAlloc(handle, rxBdRing->buffSize, handle->cfg.userData);
                if (newBuff == NULL)
                {
                    while (index-- > 0U)
                    {
                        handle->cfg.rxBuffFree(handle, frame->buffArray[index].buffer, handle->cfg.userData);
                    }
                    /* When appliction buffer pool is not enough, drop frame in the BD to keep frame latest. */
                    result = kStatus_NETC_LackOfResource;
                    break;
                }

                /* Store in this strcuture, and exchange the buffer in the BD in below code. */
                frame->buffArray[index].buffer = newBuff;
                index++;
            } while (--buffNum != 0U);
        }
    }

    if (result != kStatus_Success)
    {
        frame->length = 0;
        EP_DropFrame(handle->epHandle, rxBdRing, rxBdRingIdx);
        return result;
    }

    return EP_ReceiveFrameCommon(handle->epHandle, rxBdRing, rxBdRingIdx, frame, attr, handle->cfg.rxCacheMaintain);
}

static status_t SWT_GetIdleCmdBDRing(swt_handle_t *handle, netc_cbdr_handle_t *cdbrHandle)
{
    for (uint32_t i = 0U; i < handle->cfg.cmdRingUse; i++)
    {
        if (0U == (handle->hw.base->NUM_CBDR[i].CBDRSR & NETC_SW_CBDRSR_BUSY_MASK))
        {
            cdbrHandle->base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.base->NUM_CBDR[i].CBDRMR;
            cdbrHandle->cmdr   = &handle->cmdBdRing[i];
            cdbrHandle->buffer = s_cmdDataBuffer[i];
            return kStatus_Success;
        }
    }
    return kStatus_NETC_LackOfResource;
}

status_t SWT_CmdBDRInit(swt_handle_t *handle, netc_hw_swt_cbdr_idx_t ring, const netc_cmd_bdr_config_t *config)
{
    assert(handle != NULL);
    return NETC_CmdBDRInit((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.base->NUM_CBDR[ring].CBDRMR, config);
}

status_t SWT_CmdBDRDeinit(swt_handle_t *handle, netc_hw_swt_cbdr_idx_t ring)
{
    assert(handle != NULL);
    return NETC_CmdBDRDeinit((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.base->NUM_CBDR[ring].CBDRMR);
}

status_t SWT_RxIPFAddTableEntry(swt_handle_t *handle, netc_tb_ipf_config_t *config, uint32_t *entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddIPFTableEntry(&cdbrHandle, config, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxIPFUpdateTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_ipf_cfge_t *cfg)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_UpdateIPFTableEntry(&cdbrHandle, entryID, cfg);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxIPFQueryTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_ipf_config_t *config)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_QueryIPFTableEntry(&cdbrHandle, entryID, config);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxIPFDelTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_DelIPFTableEntry(&cdbrHandle, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxIPFResetMatchCounter(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_ResetIPFMatchCounter(&cdbrHandle, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

