tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_RxIPFGetMatchedCount(swt_handle_t *handle, uint32_t entryID, uint64_t *count)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_GetIPFMatchedCount(&cdbrHandle, entryID, count);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_BridgeInit(swt_handle_t *handle, const netc_swt_bridge_config_t *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    /* Configure switch default VLAN filter entry */
    handle->hw.base->VFHTDECR0 = NETC_SW_VFHTDECR0_IPMFLE(config->dVFCfg.enIPMFlood) |
                                 NETC_SW_VFHTDECR0_IPMFE(config->dVFCfg.enIPMFilter) |
                                 NETC_SW_VFHTDECR0_STG_ID(config->dVFCfg.stgID) |
                                 ((config->dVFCfg.portMembership << NETC_SW_VFHTDECR0_PORT0_SHIFT) &
                                  (
#if defined(NETC_SW_VFHTDECR0_PORT4_MASK)
                                      NETC_SW_VFHTDECR0_PORT4_MASK |
#endif
                                      NETC_SW_VFHTDECR0_PORT3_MASK | NETC_SW_VFHTDECR0_PORT2_MASK |
                                      NETC_SW_VFHTDECR0_PORT1_MASK | NETC_SW_VFHTDECR0_PORT0_MASK));
#if defined(NETC_SW_VFHTDECR1_ET_EID)
    handle->hw.base->VFHTDECR1 = NETC_SW_VFHTDECR1_ET_EID(config->dVFCfg.baseETEID) |
#else
    handle->hw.base->VFHTDECR1 = NETC_SW_VFHTDECR1_BASE_ETEID(config->dVFCfg.baseETEID) |
#endif
                                 NETC_SW_VFHTDECR1_VL_MODE(config->dVFCfg.enUseFilterID) |
                                 NETC_SW_VFHTDECR1_FID(config->dVFCfg.filterID);
    handle->hw.base->VFHTDECR2 = NETC_SW_VFHTDECR2_MFO(config->dVFCfg.mfo) | NETC_SW_VFHTDECR2_MLO(config->dVFCfg.mlo) |
#if defined(NETC_SW_VFHTDECR2_ETA_PORT0_SHIFT)
                                 ((config->dVFCfg.etaPortBitmap << NETC_SW_VFHTDECR2_ETA_PORT0_SHIFT) &
#else
                                 ((config->dVFCfg.etaPortBitmap << NETC_SW_VFHTDECR2_ET_PORT0_SHIFT) &
#endif
                                  (
#if defined(NETC_SW_VFHTDECR2_ET_PORT4_MASK)
                                      NETC_SW_VFHTDECR2_ET_PORT4_MASK |
#endif
#if defined(NETC_SW_VFHTDECR2_ETA_PORT3_MASK)
                                      NETC_SW_VFHTDECR2_ETA_PORT3_MASK |
#else
                                      NETC_SW_VFHTDECR2_ET_PORT3_MASK |
#endif
#if defined(NETC_SW_VFHTDECR2_ETA_PORT2_MASK)
                                      NETC_SW_VFHTDECR2_ETA_PORT2_MASK |
#else
                                      NETC_SW_VFHTDECR2_ET_PORT2_MASK |
#endif
#if defined(NETC_SW_VFHTDECR2_ETA_PORT1_MASK)
                                      NETC_SW_VFHTDECR2_ETA_PORT1_MASK |
#else
                                      NETC_SW_VFHTDECR2_ET_PORT1_MASK |
#endif
#if defined(NETC_SW_VFHTDECR2_ETA_PORT0_MASK)
                                      NETC_SW_VFHTDECR2_ETA_PORT0_MASK
#else
                                      NETC_SW_VFHTDECR2_ET_PORT0_MASK
#endif
                                      ));
    return kStatus_Success;
}

status_t SWT_BridgeConfigPort(swt_handle_t *handle,
                              netc_hw_port_idx_t portIdx,
                              const netc_swt_port_bridge_config_t *config)
{
    assert((handle != NULL) && (config != NULL));

    NETC_PORT_Type *base  = handle->hw.ports[portIdx].port;
    uint32_t stgMode      = 0U;
    uint8_t tagAccepyMode = (uint8_t)config->acceptUntag | ((uint8_t)config->acceptPriorityTag << 1U) |
                            ((uint8_t)config->acceptSingleTag << 2U) | ((uint8_t)config->acceptDoubleTag << 3U);

    for (uint32_t i = 0U; i < 16U; i++)
    {
        stgMode |= ((uint32_t)config->stgMode[i] & NETC_PORT_BPSTGSR_STG_STATE0_MASK) << (i * 2U);
    }
    base->BPSTGSR = stgMode;
    base->BPDVR   = NETC_PORT_BPDVR_TXTAGA(config->txVlanAction) | NETC_PORT_BPDVR_RXVAM(!config->isRxVlanAware) |
                  NETC_PORT_BPDVR_RXTAGA(tagAccepyMode) | NETC_PORT_BPDVR_TPID(config->defaultVlan.tpid) |
                  NETC_PORT_BPDVR_PCP(config->defaultVlan.pcp) | NETC_PORT_BPDVR_DEI(config->defaultVlan.dei) |
                  NETC_PORT_BPDVR_VID(config->defaultVlan.vid);
    base->BPCR = NETC_PORT_BPCR_SRCPRND(!config->enSrcPortPrun) | NETC_PORT_BPCR_STAMVD(!config->enMacStationMove) |
                 NETC_PORT_BPCR_BCASTE(config->enBcastStormCtrl) | NETC_PORT_BPCR_MCASTE(config->enMcastStormCtrl) |
                 NETC_PORT_BPCR_UMCASTE(config->enUnMcastStormCtrl) |
                 NETC_PORT_BPCR_UUCASTE(config->enUnUcastStormCtrl) | NETC_PORT_BPCR_DYN_LIMIT(config->maxDynaFDBEntry);
    base->BPSCR0 =
        NETC_PORT_BPSCR0_BCASTRPEID(config->bcastRpEntryID) | NETC_PORT_BPSCR0_UUCASTRPEID(config->unUcastRpEntryID);
    base->BPSCR1 =
        NETC_PORT_BPSCR1_UMCASTRPEID(config->unMcastRpEntryID) | NETC_PORT_BPSCR1_MCASTRPEID(config->mcastEntryID);
    return kStatus_Success;
}

status_t SWT_BridgeConfigPortDefaultVid(swt_handle_t *handle, netc_hw_port_idx_t portIdx, uint16_t vid)
{
    assert(handle != NULL);
    NETC_PORT_Type *base = handle->hw.ports[portIdx].port;

    base->BPDVR = (base->BPDVR & ~NETC_PORT_BPDVR_VID_MASK) | NETC_PORT_BPDVR_VID(vid);

    return kStatus_Success;
}

status_t SWT_BridgeAddVFTableEntry(swt_handle_t *handle, netc_tb_vf_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL));
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_vf_req_data_t));
        /* Add entry to VLAN Filter Table and query the ENTRY_ID  */
        cdbrHandle.buffer->vf.request.cfge                       = config->cfge;
        cdbrHandle.buffer->vf.request.keye                       = config->keye;
        cdbrHandle.buffer->vf.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->vf.request.commonHeader.queryActions  = 1U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_vf_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_vf_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_VFTable;
        cmdBd.req.cmd                                            = kNETC_AddAndQueryEntry;
        /* Add operation only support Exact Key Element Match */
        cmdBd.req.accessType = kNETC_ExactKeyMatch;
        status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *entryID = cdbrHandle.buffer->vf.response.entryID;
        }
    }

