tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
    return status;
}

status_t SWT_BridgeUpdateFDBTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_cfge_t *cfg)
{
    assert((handle != NULL) && (cfg != NULL));
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fdb_req_data_t));
        /* Update entry in FDB Table based on the ENTRY_ID  */
        cdbrHandle.buffer->fdb.request.cfge                       = *cfg;
        cdbrHandle.buffer->fdb.request.entryID                    = entryID;
        cdbrHandle.buffer->fdb.request.commonHeader.updateActions = (uint16_t)kNETC_FDBCfgEUpdate;
        cdbrHandle.buffer->fdb.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = sizeof(netc_tb_fdb_req_data_t);
        cmdBd.req.resLength                                       = sizeof(netc_tb_fdb_rsp_data_t);
        cmdBd.req.tableId                                         = kNETC_FDBTable;
        cmdBd.req.cmd                                             = kNETC_UpdateEntry;
        cmdBd.req.accessType                                      = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_BridgeSearchFDBTableEntry(swt_handle_t *handle,
                                       netc_tb_fdb_search_criteria_t *sCriteria,
                                       netc_tb_fdb_rsp_data_t *rsp)
{
    assert((handle != NULL) && (sCriteria != NULL) && (rsp != NULL));
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fdb_req_data_t));
        /* Query entry in FDB Table based on the search criteria */
        cdbrHandle.buffer->fdb.request.sCriteria                 = *sCriteria;
        cdbrHandle.buffer->fdb.request.commonHeader.queryActions = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_fdb_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_fdb_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_FDBTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_Search;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            if (0U != cmdBd.resp.numMatched)
            {
                *rsp = cdbrHandle.buffer->fdb.response;
            }
            else
            {
                status = kStatus_NETC_NotFound;
            }
        }
    }

    return status;
}

status_t SWT_BridgeQueryFDBTableEntry(swt_handle_t *handle, netc_tb_fdb_keye_t *keye, netc_tb_fdb_rsp_data_t *rsp)
{
    assert((handle != NULL) && (keye != NULL) && (rsp != NULL));
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fdb_req_data_t));
        /* Query entry in FDB Table based on the exact match criteria */
        cdbrHandle.buffer->fdb.request.keye                      = *keye;
        cdbrHandle.buffer->fdb.request.commonHeader.queryActions = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_fdb_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_fdb_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_FDBTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_ExactKeyMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            if (0U != cmdBd.resp.numMatched)
            {
                *rsp = cdbrHandle.buffer->fdb.response;
            }
            else
            {
                status = kStatus_NETC_NotFound;
            }
        }
    }

    return status;
}

status_t SWT_BridgeDelFDBTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fdb_req_data_t));
        cdbrHandle.buffer->fdb.request.entryID                    = entryID;
        cdbrHandle.buffer->fdb.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->fdb.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = 36U;
        cmdBd.req.resLength                                       = 4U;
        cmdBd.req.tableId                                         = kNETC_FDBTable;
        cmdBd.req.cmd                                             = kNETC_DeleteEntry;
        cmdBd.req.accessType                                      = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_BridgeGetFDBActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_acte_t *state)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fdb_req_data_t));
        cdbrHandle.buffer->fdb.request.entryID                    = entryID;
        cdbrHandle.buffer->fdb.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->fdb.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = 36U;
        cmdBd.req.resLength                                       = sizeof(netc_tb_fdb_rsp_data_t);
        cmdBd.req.tableId                                         = kNETC_FDBTable;
        cmdBd.req.cmd                                             = kNETC_QueryEntry;
        cmdBd.req.accessType                                      = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *state = cdbrHandle.buffer->fdb.response.acte;
        }
    }

