tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
    return status;
}

status_t SWT_BridgeAddL2MCFTableEntry(swt_handle_t *handle, netc_tb_l2mcf_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL));
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_l2mcf_req_data_t));
        /* Add entry to L2MCF Table and query the ENTRY_ID  */
        cdbrHandle.buffer->l2mcf.request.cfge                       = config->cfge;
        cdbrHandle.buffer->l2mcf.request.keye                       = config->keye;
        cdbrHandle.buffer->l2mcf.request.commonHeader.updateActions = (uint16_t)kNETC_FDBCfgEUpdate;
        cdbrHandle.buffer->l2mcf.request.commonHeader.queryActions  = 1U;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = sizeof(netc_tb_l2mcf_req_data_t);
        cmdBd.req.resLength                                         = sizeof(netc_tb_l2mcf_rsp_data_t);
        cmdBd.req.tableId                                           = kNETC_L2MCFTable;
        cmdBd.req.cmd                                               = kNETC_AddAndQueryEntry;
        /* Add operation only support Exact Key Element Match */
        cmdBd.req.accessType = kNETC_ExactKeyMatch;
        status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *entryID = cdbrHandle.buffer->l2mcf.response.entryID;
        }
    }
    return status;
}

status_t SWT_BridgeUpdateL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_cfge_t *cfg)
{
    assert((handle != NULL) && (cfg != NULL));
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_l2mcf_req_data_t));
        /* Add entry to L2MCF Table base on the ENTRY_ID  */
        cdbrHandle.buffer->l2mcf.request.cfge                       = *cfg;
        cdbrHandle.buffer->l2mcf.request.entryID                    = entryID;
        cdbrHandle.buffer->l2mcf.request.commonHeader.updateActions = (uint16_t)kNETC_FDBCfgEUpdate;
        cdbrHandle.buffer->l2mcf.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = sizeof(netc_tb_l2mcf_req_data_t);
        cmdBd.req.resLength                                         = sizeof(netc_tb_l2mcf_rsp_data_t);
        cmdBd.req.tableId                                           = kNETC_L2MCFTable;
        cmdBd.req.cmd                                               = kNETC_UpdateEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_BridgeSearchL2MCFTableEntry(swt_handle_t *handle,
                                         netc_tb_l2mcf_search_criteria_t *sCriteria,
                                         netc_tb_l2mcf_rsp_data_t *rsp)
{
    assert((handle != NULL) && (sCriteria != NULL) && (rsp != NULL));
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_l2mcf_req_data_t));
        /* Query entry in L2MCF Table base on the search criteria */
        cdbrHandle.buffer->l2mcf.request.sCriteria                 = *sCriteria;
        cdbrHandle.buffer->l2mcf.request.commonHeader.queryActions = 0U;
        cmdBd.req.addr                                             = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                        = sizeof(netc_tb_l2mcf_req_data_t);
        cmdBd.req.resLength                                        = sizeof(netc_tb_l2mcf_rsp_data_t);
        cmdBd.req.tableId                                          = kNETC_L2MCFTable;
        cmdBd.req.cmd                                              = kNETC_QueryEntry;
        cmdBd.req.accessType                                       = kNETC_Search;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            if (0U != cmdBd.resp.numMatched)
            {
                *rsp = cdbrHandle.buffer->l2mcf.response;
            }
            else
            {
                status = kStatus_NETC_NotFound;
            }
        }
    }
    return status;
}

status_t SWT_BridgeDelL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_l2mcf_req_data_t));
        cdbrHandle.buffer->l2mcf.request.entryID                    = entryID;
        cdbrHandle.buffer->l2mcf.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->l2mcf.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 36U;
        /* Add command response data buffer only contains 4 bytes status filed */
        cmdBd.req.resLength  = 4U;
        cmdBd.req.tableId    = kNETC_L2MCFTable;
        cmdBd.req.cmd        = kNETC_DeleteEntry;
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_BridgeGetL2MCFActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_acte_t *state)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_l2mcf_req_data_t));
        cdbrHandle.buffer->l2mcf.request.entryID                    = entryID;
        cdbrHandle.buffer->l2mcf.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->l2mcf.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 36U;
        cmdBd.req.resLength                                         = sizeof(netc_tb_l2mcf_rsp_data_t);
        cmdBd.req.tableId                                           = kNETC_L2MCFTable;
        cmdBd.req.cmd                                               = kNETC_QueryEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *state = cdbrHandle.buffer->l2mcf.response.acte;
        }
    }
    return status;
}

status_t SWT_RxPSFPAddISITableEntry(swt_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL) && (entryID != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddISITableEntry(&cdbrHandle, config, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPQueryISITableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_isi_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_QueryISITableEntry(&cdbrHandle, entryID, config);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPQueryISITableEntryWithKey(swt_handle_t *handle,
                                             netc_tb_isi_keye_t *keye,
                                             netc_tb_isi_rsp_data_t *rsp)
{
    assert((handle != NULL) && (keye != NULL) && (rsp != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_QueryISITableEntryWithKey(&cdbrHandle, keye, rsp);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPDelISITableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_DelISITableEntry(&cdbrHandle, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPAddISTableEntry(swt_handle_t *handle, netc_tb_is_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddOrUpdateISTableEntry(&cdbrHandle, config, true);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPUpdateISTableEntry(swt_handle_t *handle, netc_tb_is_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddOrUpdateISTableEntry(&cdbrHandle, config, false);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPQueryISTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_is_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_QueryISTableEntry(&cdbrHandle, entryID, config);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

