tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_RxPSFPGetSGCLState(swt_handle_t *handle, uint32_t entryID, netc_tb_sgcl_sgclse_t *state)
{
    assert((handle != NULL) && (state != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_GetSGCLState(&cdbrHandle, entryID, state);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPAddRPTableEntry(swt_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_AddEntry);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPUpdateRPTableEntry(swt_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_UpdateEntry);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPAddOrUpdateRPTableEntry(swt_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_AddOrUpdateEntry);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPResetMRRPTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_ResetMRRPTableEntry(&cdbrHandle, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPDelRPTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_DelRPTableEntry(&cdbrHandle, entryID);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPQueryRPTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_rp_rsp_data_t *rsp)
{
    assert((handle != NULL) && (rsp != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_QueryRPTableEntry(&cdbrHandle, entryID, rsp);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_RxPSFPGetRPStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_rp_stse_t *statis)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_GetRPStatistic(&cdbrHandle, entryID, statis);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxTrafficClassConfig(swt_handle_t *handle,
                                  netc_hw_port_idx_t portIdx,
                                  netc_hw_tc_idx_t tcIdx,
                                  const netc_port_tx_tc_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    NETC_PORT_Type *base = handle->hw.ports[portIdx].port;
    status_t result;
    uint32_t temp;

    if (!NETC_PortIsPseudo(base))
    {
        NETC_PortConfigTcPreemption(base, tcIdx, config->enPreemption);
    }
    temp        = base->PDGSR & (~((uint32_t)1U << (uint32_t)tcIdx));
    base->PDGSR = temp | ((uint32_t)config->enTcGate << (uint32_t)tcIdx);

    result = NETC_PortConfigTcMaxSDU(base, tcIdx, &config->sduCfg);
    if ((kStatus_Success == result) && (config->enableCbs))
    {
        result = NETC_PortConfigTcCBS(base, tcIdx, &config->cbsCfg);
    }
    return result;
}

#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
status_t SWT_TxPortTGSEnable(swt_handle_t *handle, netc_hw_port_idx_t portIdx, bool enable, uint8_t gateState)
#else
status_t SWT_TxPortTGSEnable(swt_handle_t *handle, netc_hw_port_idx_t portIdx, bool enable)
#endif
{
    assert(handle != NULL);
    status_t result = kStatus_Success;

    if (enable)
    {
        handle->hw.ports[portIdx].port->PTGSCR |= NETC_PORT_PTGSCR_TGE_MASK;
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
        netc_tgs_gate_entry_t gate[2] = {{.interval = 50000U, .tcGateState = gateState},
                                         {.interval = 50000U, .tcGateState = gateState}};
        netc_tb_tgs_gcl_t wTgsList    = {
               .entryID = (netc_tb_tgs_entry_id_t)portIdx, .cycleTime = 1000000U, .numEntries = 2U, .gcList = &gate[0]};
        uint64_t time;
        /* Enable master bus and memory access for default ns timer*/
        TMR_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
        NETC_TimerGetTime(TMR0_BASE, &time);
        wTgsList.baseTime = time;
        result            = SWT_TxTGSConfigAdminGcl(handle, &wTgsList);
#endif
    }
    else
    {
        handle->hw.ports[portIdx].port->PTGSCR &= ~NETC_PORT_PTGSCR_TGE_MASK;
    }

    return result;
}

status_t SWT_TxTGSConfigAdminGcl(swt_handle_t *handle, netc_tb_tgs_gcl_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_Success;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        if (0U != (handle->hw.ports[config->entryID].port->PTGAGLSR & NETC_PORT_PTGAGLSR_CFG_PEND_MASK))
        {
            /* Removed the previous pending administrative gate control list */
            netc_tb_tgs_gcl_t emptyList = {.entryID = config->entryID, .numEntries = 0U};
            status                      = NETC_ConfigTGSAdminList(&cdbrHandle, &emptyList);

            if (kStatus_Success != status)
            {
                return status;
            }
        }
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051587) && FSL_FEATURE_NETC_HAS_ERRATA_051587
        if (0U != (handle->hw.ports[config->entryID].port->PTGAGLSR & NETC_PORT_PTGAGLSR_TG_MASK))
        {
            netc_cmd_bd_t cmdBd = {0};
            uint32_t cycleTime;
            uint64_t time, minBaseTime;

            /* Read the previous active Operationa gate control list cycle time*/
            (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_tgs_req_data_t));
            cdbrHandle.buffer->tgs.request.entryID                    = config->entryID;
            cdbrHandle.buffer->tgs.request.commonHeader.updateActions = 0U;
            cdbrHandle.buffer->tgs.request.commonHeader.queryActions  = 0U;
            cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
            cmdBd.req.reqLength                                       = 8U;
            /* Set Response Data Buffer length to MAX */
            cmdBd.req.resLength  = sizeof(netc_tb_tgs_data_t);
            cmdBd.req.tableId    = kNETC_TGSTable;
            cmdBd.req.cmd        = kNETC_QueryEntry;
            cmdBd.req.accessType = kNETC_EntryIDMatch;
            status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
            if (kStatus_Success == status)
            {
                cycleTime = ((netc_tb_tgs_olse_t *)(uintptr_t)(&((uint8_t *)cdbrHandle.buffer)[36U]))->operCycleTime;
            }
            else
            {
                return status;
            }
            /* Get Current Time */
            NETC_TimerGetTime(TMR0_BASE, &time);
            /* The minimum base time = current time + advance time (0.1us) + command processing time (~90us) + (2 *
             * operational cycle times) */
            minBaseTime = time + 100100U + (2U * cycleTime);
            /* Check, if there is operating GCL and if admin base time is in range described in ERR051587*/
            if ((config->numEntries > 0U) && (config->baseTime < minBaseTime))
            {
                config->baseTime +=
                    (((uint64_t)ceil(((double)minBaseTime - (double)config->baseTime) / (double)config->cycleTime))) *
                    config->cycleTime;
            }
        }
#endif
        /* Install the new administrative gate control list */
        return NETC_ConfigTGSAdminList(&cdbrHandle, config);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxtTGSGetOperGcl(swt_handle_t *handle, netc_tb_tgs_gcl_t *gcl, uint32_t length)
{
    assert((handle != NULL) && (gcl != NULL));
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        return NETC_GetTGSOperationList(&cdbrHandle, gcl, length);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

