tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_FMAddTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fm_req_data_t));
        /* Add entry to FM Table */
        cdbrHandle.buffer->fm.request.cfge                       = config->cfge;
        cdbrHandle.buffer->fm.request.entryID                    = config->entryID;
        cdbrHandle.buffer->fm.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->fm.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_fm_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_fm_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_FMTable;
        cmdBd.req.cmd                                            = kNETC_AddEntry;
        /* Add operation only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_FMUpdateTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fm_req_data_t));
        /* Add entry to FM Table */
        cdbrHandle.buffer->fm.request.cfge                       = config->cfge;
        cdbrHandle.buffer->fm.request.entryID                    = config->entryID;
        cdbrHandle.buffer->fm.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->fm.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_fm_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_fm_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_FMTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_FMDelTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fm_req_data_t));
        cdbrHandle.buffer->fm.request.entryID                    = entryID;
        cdbrHandle.buffer->fm.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->fm.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_fm_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_fm_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_FMTable;
        cmdBd.req.cmd                                            = kNETC_DeleteEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_FMQueryTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_fm_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fm_config_t));
        cdbrHandle.buffer->fm.request.entryID                    = entryID;
        cdbrHandle.buffer->fm.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->fm.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = 8U;
        cmdBd.req.resLength                                      = sizeof(netc_tb_fm_config_t);
        cmdBd.req.tableId                                        = kNETC_FMTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        /* Only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            (void)memcpy(&config->cfge, &cdbrHandle.buffer->fm.response.cfge, sizeof(netc_tb_fm_cfge_t));
        }
    }

    return status;
}

status_t SWT_FMDUpdateTableEntry(swt_handle_t *handle, netc_tb_fmd_update_config_t *config, uint32_t length)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_fmd_req_data_t));
        cdbrHandle.buffer->fmd.request.entryID                    = config->entryID;
        cdbrHandle.buffer->fmd.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->fmd.request.commonHeader.queryActions  = 0U;
        (void)memcpy((void *)&cdbrHandle.buffer->fmd.request.cfge, (void *)&config->cfge, length);
        cmdBd.req.addr      = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength = length + 8U;
        cmdBd.req.resLength = length + 8U;
        cmdBd.req.tableId   = kNETC_FMDTable;
        cmdBd.req.cmd       = kNETC_UpdateEntry;
        /* Only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

