tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_FMDQueryTableEntry(swt_handle_t *handle, netc_tb_fmd_query_buffer_t *query, uint32_t length)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, length + 4U);
        cdbrHandle.buffer->fmd.request.entryID                    = query->entryID;
        cdbrHandle.buffer->fmd.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->fmd.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = 8U;
        cmdBd.req.resLength                                       = length + 4U;
        cmdBd.req.tableId                                         = kNETC_FMDTable;
        cmdBd.req.cmd                                             = kNETC_QueryEntry;
        /* Only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            (void)memcpy(&query->cfge, &cdbrHandle.buffer->fmd.response.cfge, length);
        }
    }

    return status;
}

status_t SWT_TxEPPAddETTableEntry(swt_handle_t *handle, netc_tb_et_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_et_req_data_t));
        /* Add entry to ET Table */
        cdbrHandle.buffer->et.request.cfge                       = config->cfge;
        cdbrHandle.buffer->et.request.entryID                    = config->entryID;
        cdbrHandle.buffer->et.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->et.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_et_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_et_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ETTable;
        cmdBd.req.cmd                                            = kNETC_AddEntry;
        /* Add operation only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxEPPUpdateETTableEntry(swt_handle_t *handle, netc_tb_et_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_et_req_data_t));
        /* Update entry to ET Table */
        cdbrHandle.buffer->et.request.cfge                       = config->cfge;
        cdbrHandle.buffer->et.request.entryID                    = config->entryID;
        cdbrHandle.buffer->et.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->et.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_et_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_et_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ETTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        /* Add operation only support Entry ID Match */
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxEPPQueryETTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_et_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_NETC_LackOfResource;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_et_req_data_t));
        cdbrHandle.buffer->et.request.entryID                    = entryID;
        cdbrHandle.buffer->et.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->et.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_et_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_et_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ETTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            if (0U != cmdBd.resp.numMatched)
            {
                config->entryID = cdbrHandle.buffer->et.response.entryID;
                config->cfge    = cdbrHandle.buffer->et.response.cfge;
            }
            else
            {
                status = kStatus_NETC_NotFound;
            }
        }
    }

    return status;
}

status_t SWT_TxEPPDelETTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_et_req_data_t));
        cdbrHandle.buffer->et.request.entryID                    = entryID;
        cdbrHandle.buffer->et.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->et.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_et_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_et_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ETTable;
        cmdBd.req.cmd                                            = kNETC_DeleteEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxEPPQosToVlanConfig(swt_handle_t *handle, const netc_swt_qos_to_vlan_config_t *config)
{
    for (uint32_t i = 0U; i < 2U; i++)
    {
        for (uint32_t j = 0U; j < 4U; j++)
        {
            handle->hw.base->MAP_PCP[i].QOSVLANMPR[j] =
                NETC_SW_QOSVLANMPR_IPV0_DR0(config->profiles[i].qos[j * 8U]) |
                NETC_SW_QOSVLANMPR_IPV0_DR1(config->profiles[i].qos[j * 8U + 1U]) |
                NETC_SW_QOSVLANMPR_IPV0_DR2(config->profiles[i].qos[j * 8U + 2U]) |
                NETC_SW_QOSVLANMPR_IPV0_DR1(config->profiles[i].qos[j * 8U + 3U]) |
                NETC_SW_QOSVLANMPR_IPV1_DR0(config->profiles[i].qos[j * 8U + 4U]) |
                NETC_SW_QOSVLANMPR_IPV1_DR1(config->profiles[i].qos[j * 8U + 5U]) |
                NETC_SW_QOSVLANMPR_IPV1_DR2(config->profiles[i].qos[j * 8U + 6U]) |
                NETC_SW_QOSVLANMPR_IPV1_DR3(config->profiles[i].qos[j * 8U + 7U]);
        }
        handle->hw.base->PCP2PCPMPR[i] =
            NETC_SW_PCP2PCPMPR_PCP0(config->profiles[i].pcp[0]) | NETC_SW_PCP2PCPMPR_PCP1(config->profiles[i].pcp[1]) |
            NETC_SW_PCP2PCPMPR_PCP2(config->profiles[i].pcp[2]) | NETC_SW_PCP2PCPMPR_PCP3(config->profiles[i].pcp[3]) |
            NETC_SW_PCP2PCPMPR_PCP4(config->profiles[i].pcp[4]) | NETC_SW_PCP2PCPMPR_PCP5(config->profiles[i].pcp[5]) |
            NETC_SW_PCP2PCPMPR_PCP6(config->profiles[i].pcp[6]) | NETC_SW_PCP2PCPMPR_PCP7(config->profiles[i].pcp[7]);
    }
    return kStatus_Success;
}

