tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
status_t SWT_GetECStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_ec_stse_t *statistic)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_ec_req_data_t));
        cdbrHandle.buffer->ec.request.entryID                    = entryID;
        cdbrHandle.buffer->ec.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->ec.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_ec_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_ec_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *statistic = cdbrHandle.buffer->ec.response.stse;
        }
    }
    return status;
}

status_t SWT_ResetECStatistic(swt_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_ec_req_data_t));
        /* Reset EC Table according to the ENTRY_ID (EC_EID) */
        cdbrHandle.buffer->ec.request.entryID                    = entryID;
        cdbrHandle.buffer->ec.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->ec.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_ec_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_ec_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxETMConfigClassQueue(swt_handle_t *handle, netc_tb_etmcq_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_etmcq_data_t));
        cdbrHandle.buffer->cq.request.entryID = config->entryID;
        cdbrHandle.buffer->cq.request.cfge    = config->cfge;
        cdbrHandle.buffer->cq.request.commonHeader.updateActions =
            (uint16_t)kNETC_CQCfgEUpdate | (uint16_t)kNETC_CQStsEUpdate;
        cdbrHandle.buffer->cq.request.commonHeader.queryActions = 0U;
        cmdBd.req.addr                                          = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                     = sizeof(netc_tb_etmcq_req_data_t);
        cmdBd.req.resLength                                     = sizeof(netc_tb_etmcq_rsp_data_t);
        cmdBd.req.tableId                                       = kNETC_ECQTable;
        cmdBd.req.cmd                                           = kNETC_UpdateEntry;
        cmdBd.req.accessType                                    = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_GetETMClassQueueStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_etmcq_stse_t *statistic)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_etmcq_data_t));
        cdbrHandle.buffer->cq.request.entryID                    = entryID;
        cdbrHandle.buffer->cq.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->cq.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_etmcq_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_etmcq_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECQTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *statistic = cdbrHandle.buffer->cq.response.stse;
        }
    }
    return status;
}
status_t SWT_TxETMConfigClassScheduler(swt_handle_t *handle, netc_tb_etmcs_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_etmcs_data_t));
        cdbrHandle.buffer->cs.request.entryID                    = config->entryID;
        cdbrHandle.buffer->cs.request.cfge                       = config->cfge;
        cdbrHandle.buffer->cs.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->cs.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_etmcs_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_etmcs_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECSTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_TxETMConfigCongestionGroup(swt_handle_t *handle, netc_tb_etmcg_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_etmcg_data_t));
        cdbrHandle.buffer->cg.request.entryID                    = config->entryID;
        cdbrHandle.buffer->cg.request.cfge                       = config->cfge;
        cdbrHandle.buffer->cg.request.commonHeader.updateActions = 1U;
        cdbrHandle.buffer->cg.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_etmcg_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_etmcg_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECGTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        return NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
    else
    {
        return kStatus_NETC_LackOfResource;
    }
}

status_t SWT_GetETMCongestionGroupStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_etmcg_stse_t *statistic)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_NETC_LackOfResource;
    netc_cbdr_handle_t cdbrHandle;

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_etmcg_data_t));
        cdbrHandle.buffer->cg.request.entryID                    = entryID;
        cdbrHandle.buffer->cg.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->cg.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_etmcg_req_data_t);
        cmdBd.req.resLength                                      = sizeof(netc_tb_etmcg_rsp_data_t);
        cmdBd.req.tableId                                        = kNETC_ECGTable;
        cmdBd.req.cmd                                            = kNETC_QueryEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            *statistic = cdbrHandle.buffer->cg.response.stse;
        }
    }
    return status;
}

status_t SWT_FRERAddISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config)
{
    assert(handle != NULL);

