tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
    uint32_t entryNumMax = handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (config->entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->iseqg.request.entryID                    = config->entryID;
        cdbrHandle.buffer->iseqg.request.commonHeader.updateActions = kNETC_ISEQGCfgEUpdate;
        cdbrHandle.buffer->iseqg.request.commonHeader.queryActions  = 0U;
        cdbrHandle.buffer->iseqg.request.cfge                       = config->cfge;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 12U;
        cmdBd.req.resLength                                         = 8U;
        cmdBd.req.tableId                                           = kNETC_ISGTable;
        cmdBd.req.cmd                                               = kNETC_AddEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

    return status;
}

status_t SWT_FRERUpdateISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (config->entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->iseqg.request.entryID                    = config->entryID;
        cdbrHandle.buffer->iseqg.request.commonHeader.updateActions = kNETC_ISEQGCfgEUpdate;
        cdbrHandle.buffer->iseqg.request.commonHeader.queryActions  = 0U;
        cdbrHandle.buffer->iseqg.request.cfge                       = config->cfge;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 12U;
        cmdBd.req.resLength                                         = 8U;
        cmdBd.req.tableId                                           = kNETC_ISGTable;
        cmdBd.req.cmd                                               = kNETC_UpdateEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

    return status;
}

status_t SWT_FRERResetSEQGTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->iseqg.request.entryID                    = entryID;
        cdbrHandle.buffer->iseqg.request.commonHeader.updateActions = kNETC_ISEQGSgsEUpdate;
        cdbrHandle.buffer->iseqg.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 12U;
        cmdBd.req.resLength                                         = 8U;
        cmdBd.req.tableId                                           = kNETC_ISGTable;
        cmdBd.req.cmd                                               = kNETC_UpdateEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

    return status;
}

status_t SWT_FRERDelISEQGTableEntry(swt_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->iseqg.request.entryID                    = entryID;
        cdbrHandle.buffer->iseqg.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->iseqg.request.commonHeader.queryActions  = 0;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 12U;
        cmdBd.req.resLength                                         = 8U;
        cmdBd.req.tableId                                           = kNETC_ISGTable;
        cmdBd.req.cmd                                               = kNETC_DeleteEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

    return status;
}

status_t SWT_FRERGetISEQGState(swt_handle_t *handle, uint32_t entryID, netc_tb_iseqg_sgse_t *state)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ISQGITCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

