tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.c
    if (entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->iseqg.request.entryID                    = entryID;
        cdbrHandle.buffer->iseqg.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->iseqg.request.commonHeader.queryActions  = 0;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 12U;
        cmdBd.req.resLength                                         = 8U;
        cmdBd.req.tableId                                           = kNETC_ISGTable;
        cmdBd.req.cmd                                               = kNETC_QueryEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (status == kStatus_Success)
        {
            *state = cdbrHandle.buffer->iseqg.response.sgse;
        }
    }

    return status;
}

status_t SWT_FRERConfigESEQRTableEntry(swt_handle_t *handle, netc_tb_eseqr_config_t *config)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ESQRTCAPR & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (config->entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->eseqr.request.entryID                    = config->entryID;
        cdbrHandle.buffer->eseqr.request.commonHeader.updateActions = 0x7;
        cdbrHandle.buffer->eseqr.request.commonHeader.queryActions  = 0;
        cdbrHandle.buffer->eseqr.request.cfge                       = config->cfge;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 16U;
        cmdBd.req.resLength                                         = 84U;
        cmdBd.req.tableId                                           = kNETC_ESRTable;
        cmdBd.req.cmd                                               = kNETC_UpdateEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

    return status;
}

status_t SWT_FRERQueryESEQRTableEntry(swt_handle_t *handle,
                                      uint32_t entryID,
                                      netc_tb_eseqr_stse_t *statistic,
                                      netc_tb_eseqr_cfge_t *config,
                                      netc_tb_eseqr_srse_t *state)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.common->ESQRTCAPR & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->eseqr.request.entryID                    = entryID;
        cdbrHandle.buffer->eseqr.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->eseqr.request.commonHeader.queryActions  = 0;
        cmdBd.req.addr                                              = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                         = 16U;
        cmdBd.req.resLength                                         = 84U;
        cmdBd.req.tableId                                           = kNETC_ESRTable;
        cmdBd.req.cmd                                               = kNETC_QueryEntry;
        cmdBd.req.accessType                                        = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (status == kStatus_Success)
        {
            *statistic = cdbrHandle.buffer->eseqr.response.stse;

            if (config != NULL)
            {
                *config = cdbrHandle.buffer->eseqr.response.cfge;
            }

            *state = cdbrHandle.buffer->eseqr.response.srse;
        }
    }

    return status;
}

status_t SWT_FRERGetESEQRStatistic(swt_handle_t *handle,
                                   uint32_t entryID,
                                   netc_tb_eseqr_stse_t *statistic,
                                   netc_tb_eseqr_srse_t *state)
{
    return SWT_FRERQueryESEQRTableEntry(handle, entryID, statistic, NULL, state);
}

status_t SWT_UpdateBPTableEntry(swt_handle_t *handle, netc_tb_bp_config_t *config)
{
    assert(handle != NULL);

    uint32_t entryNumMax = handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_BP_MASK;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (config->entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->bp.request.entryID                    = config->entryID;
        cdbrHandle.buffer->bp.request.commonHeader.updateActions = 0x3;
        cdbrHandle.buffer->bp.request.commonHeader.queryActions  = 0;
        cdbrHandle.buffer->bp.request.cfge                       = config->cfge;
        cmdBd.req.addr                                           = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                      = sizeof(netc_tb_bp_req_data_t);
        cmdBd.req.resLength                                      = 0;
        cmdBd.req.tableId                                        = kNETC_BPTable;
        cmdBd.req.cmd                                            = kNETC_UpdateEntry;
        cmdBd.req.accessType                                     = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
    }

